In [1]:
# Import libraries
import pandas as pd
import numpy as np
import datetime as dt

In [15]:
# Import pre-interpolated data and post-interpolated data
pre = pd.read_csv("../../data/processed/secchi_depth.csv")
post = pd.read_excel("../../data/processed/Secchi_merge.xlsx")

In [16]:
# assign explanatory variables in a list for easy use later

# Secchi depth

In [17]:
pre.head()

,mlid,location,datetime,lat,long,secchi_depth_meters
0,USGS-401327111462601,UTAH LAKE HAB STUDY SITE 3,20160810,40.224119,-111.773939,NaN
1,USGS-401432111454301,UTAH LAKE HAB STUDY SITE 4,20160810,40.242311,-111.761811,NaN
2,USGS-401613111463301,UTAH LAKE HAB STUDY SITE 1,20160810,40.270319,-111.775881,NaN
3,USGS-401658111491601,UTAH LAKE HAB STUDY SITE 2,20160810,40.282700,-111.821200,NaN
4,UTAHDWQ_WQX-4917305,Utah Lake at American Fork Marina near boat ramp,20160926,40.342380,-111.800839,NaN

In [18]:
post.head()

,OID,OBJECTID_1,COUNT,AREA,MEAN,STD,SUM,X25.,X50.,X75.
0,0,20160420,27254,0.036135,0.326584,0.065224,8900.717586,0.292608,0.326837,0.379791
1,1,20160525,27254,0.036135,0.200000,0.000000,5450.800081,0.200000,0.200000,0.200000
2,2,20160630,27254,0.036135,0.200000,0.000000,5450.800081,0.200000,0.200000,0.200000
3,3,20170510,27254,0.036135,0.266793,0.010521,7271.177156,0.256585,0.267754,0.272464
4,4,20170511,27254,0.036135,0.271572,0.011862,7401.413938,0.265434,0.269956,0.278423

In [23]:
# Drop rows with NA values for water quality parameters
pre = pre.dropna(subset=['secchi_depth_meters'])

In [36]:
pre.shape

(230, 6)

In [24]:
pre.datetime.nunique()

38

In [14]:
post.OBJECTID_1.nunique()

33

In [41]:
# Dates for which spatial interpolation is not needed because there is only 1 value
# good answer https://stackoverflow.com/questions/19960077/how-to-filter-pandas-dataframe-using-in-and-not-in-like-in-sql
single = pre[~pre.datetime.isin(post.OBJECTID_1)]
single.head()

,mlid,location,datetime,lat,long,secchi_depth_meters
257,UTAHDWQ_WQX-4917450,UTAH LAKE AT MIDDLE OF PROVO BAY,20170918,40.189139,-111.699931,0.20
258,UTAHDWQ_WQX-4917450,UTAH LAKE AT MIDDLE OF PROVO BAY,20171010,40.189139,-111.699931,0.38
260,UTAHDWQ_WQX-4917450,UTAH LAKE AT MIDDLE OF PROVO BAY,20180517,40.189139,-111.699931,0.25
261,UTAHDWQ_WQX-4917450,UTAH LAKE AT MIDDLE OF PROVO BAY,20180611,40.189139,-111.699931,0.10
324,UTAHDWQ_WQX-4917600,UTAH LAKE GOSHEN BAY SOUTHWEST END,20171017,40.060235,-111.874384,0.20

In [81]:
# Append rows that were not used in interpolation
for index, row in single.iterrows():
    new_row = [["n", row.datetime, "", "", row[-1], "", row[-1], row[-1], 
                row[-1], row[-1]]]
    df = pd.DataFrame(new_row,columns=['OID','OBJECTID_1','COUNT','AREA','MEAN','STD','SUM','X25.','X50.','X75.'])
    post = post.append(df,ignore_index=True)
    print (a)

[['n', 20171017, '', '', 0.2, '', 0.2, 0.2, 0.2, 0.2]]
[['n', 20171017, '', '', 0.2, '', 0.2, 0.2, 0.2, 0.2]]
[['n', 20171017, '', '', 0.2, '', 0.2, 0.2, 0.2, 0.2]]
[['n', 20171017, '', '', 0.2, '', 0.2, 0.2, 0.2, 0.2]]
[['n', 20171017, '', '', 0.2, '', 0.2, 0.2, 0.2, 0.2]]

In [82]:
post.tail(10)

   OID  OBJECTID_1 COUNT AREA  MEAN STD   SUM  X25.  X50.  X75.
33   n    20170918             0.20      0.20  0.20  0.20  0.20
34   n    20171010             0.38      0.38  0.38  0.38  0.38
35   n    20180517             0.25      0.25  0.25  0.25  0.25
36   n    20180611             0.10      0.10  0.10  0.10  0.10
37   n    20171017             0.20      0.20  0.20  0.20  0.20